#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.670+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost_log will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost_log" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost-log"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost-log"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.345+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost-log"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-vpc-west.aws_default_network_acl.shunkakinoki will be destroyed
  - resource "aws_default_network_acl" "shunkakinoki" {
      - default_network_acl_id = "acl-df9221a7" -> null
      - id                     = "acl-df9221a7" -> null
      - owner_id               = "589845989135" -> null
      - subnet_ids             = [
          - "subnet-0251d87b",
          - "subnet-165f163e",
          - "subnet-2987e573",
          - "subnet-e32e85a8",
        ] -> null
      - tags                   = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                 = "vpc-ffd6f886" -> null

      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }

      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }
    }

  # module.aws-vpc-west.aws_default_route_table.shunkakinoki will be destroyed
  - resource "aws_default_route_table" "shunkakinoki" {
      - default_route_table_id = "rtb-2083ab58" -> null
      - id                     = "rtb-2083ab58" -> null
      - owner_id               = "589845989135" -> null
      - propagating_vgws       = [] -> null
      - route                  = [
          - {
              - cidr_block                = "0.0.0.0/0"
              - egress_only_gateway_id    = ""
              - gateway_id                = "igw-3c532c5a"
              - instance_id               = ""
              - ipv6_cidr_block           = ""
              - nat_gateway_id            = ""
              - network_interface_id      = ""
              - transit_gateway_id        = ""
              - vpc_peering_connection_id = ""
            },
        ] -> null
      - tags                   = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                 = "vpc-ffd6f886" -> null
    }

  # module.aws-vpc-west.aws_default_security_group.shunkakinoki will be destroyed
  - resource "aws_default_security_group" "shunkakinoki" {
      - arn                    = "arn:aws:ec2:us-west-2:589845989135:security-group/sg-4571413b" -> null
      - description            = "default VPC security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-4571413b" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> null
      - name                   = "default" -> null
      - owner_id               = "589845989135" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                 = "vpc-ffd6f886" -> null
    }

  # module.aws-vpc-west.aws_default_subnet.shunkakinoki[0] will be destroyed
  - resource "aws_default_subnet" "shunkakinoki" {
      - arn                             = "arn:aws:ec2:us-west-2:589845989135:subnet/subnet-e32e85a8" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2a" -> null
      - availability_zone_id            = "usw2-az2" -> null
      - cidr_block                      = "172.31.32.0/20" -> null
      - id                              = "subnet-e32e85a8" -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "589845989135" -> null
      - tags                            = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                          = "vpc-ffd6f886" -> null
    }

  # module.aws-vpc-west.aws_default_subnet.shunkakinoki[1] will be destroyed
  - resource "aws_default_subnet" "shunkakinoki" {
      - arn                             = "arn:aws:ec2:us-west-2:589845989135:subnet/subnet-0251d87b" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2b" -> null
      - availability_zone_id            = "usw2-az1" -> null
      - cidr_block                      = "172.31.16.0/20" -> null
      - id                              = "subnet-0251d87b" -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "589845989135" -> null
      - tags                            = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                          = "vpc-ffd6f886" -> null
    }

  # module.aws-vpc-west.aws_default_subnet.shunkakinoki[2] will be destroyed
  - resource "aws_default_subnet" "shunkakinoki" {
      - arn                             = "arn:aws:ec2:us-west-2:589845989135:subnet/subnet-2987e573" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2c" -> null
      - availability_zone_id            = "usw2-az3" -> null
      - cidr_block                      = "172.31.0.0/20" -> null
      - id                              = "subnet-2987e573" -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "589845989135" -> null
      - tags                            = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                          = "vpc-ffd6f886" -> null
    }

  # module.aws-vpc-west.aws_default_subnet.shunkakinoki[3] will be destroyed
  - resource "aws_default_subnet" "shunkakinoki" {
      - arn                             = "arn:aws:ec2:us-west-2:589845989135:subnet/subnet-165f163e" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2d" -> null
      - availability_zone_id            = "usw2-az4" -> null
      - cidr_block                      = "172.31.48.0/20" -> null
      - id                              = "subnet-165f163e" -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "589845989135" -> null
      - tags                            = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id                          = "vpc-ffd6f886" -> null
    }

  # module.aws-vpc-west.aws_default_vpc.shunkakinoki will be destroyed
  - resource "aws_default_vpc" "shunkakinoki" {
      - arn                              = "arn:aws:ec2:us-west-2:589845989135:vpc/vpc-ffd6f886" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "172.31.0.0/16" -> null
      - default_network_acl_id           = "acl-df9221a7" -> null
      - default_route_table_id           = "rtb-2083ab58" -> null
      - default_security_group_id        = "sg-4571413b" -> null
      - dhcp_options_id                  = "dopt-51efbf28" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-ffd6f886" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-2083ab58" -> null
      - owner_id                         = "589845989135" -> null
      - tags                             = {
          - "Name" = "shunkakinoki"
        } -> null
    }

  # module.aws-vpc-west.aws_default_vpc_dhcp_options.shunkakinoki will be destroyed
  - resource "aws_default_vpc_dhcp_options" "shunkakinoki" {
      - domain_name         = "us-west-2.compute.internal" -> null
      - domain_name_servers = "AmazonProvidedDNS" -> null
      - id                  = "dopt-51efbf28" -> null
      - owner_id            = "589845989135" -> null
      - tags                = {
          - "Name" = "shunkakinoki"
        } -> null
    }

  # module.aws-vpc-west.aws_internet_gateway.shunkakinoki will be destroyed
  - resource "aws_internet_gateway" "shunkakinoki" {
      - id       = "igw-3c532c5a" -> null
      - owner_id = "589845989135" -> null
      - tags     = {
          - "Name" = "shunkakinoki"
        } -> null
      - vpc_id   = "vpc-ffd6f886" -> null
    }

Plan: 0 to add, 2 to change, 10 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
